#!/bin/bash

# ============================================================
# ЗАГЛУШКА restartkeyc.sh
# Для тестирования мониторинга Keycloak
# ============================================================

LOGFILE="/opt/keycloak/scripts/restartkeyc_test.log"


# Записываем начало "перезапуска"
echo "$(date +"%Y-%m-%d %T") РЕСТАРТ KEYCLOAK: ЗАПУЩЕН" >> "$LOGFILE"


# Имитируем время перезапуска Keycloak
sleep 5


# Записываем окончание "перезапуска"
echo "$(date +"%Y-%m-%d %T") РЕСТАРТ KEYCLOAK: ЗАВЕРШЕН" >> "$LOGFILE"
